## Plan Result (shares-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/171465)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharesAPI-Prod:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharesAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ secrets                = [
                      + {
                          + name      = "GUID_SALT"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:SharesAPI/Prod/USER_CONTEXT_SALT:guid_salt::"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/SharesAPI/Prod/SENTRY_DSN"
                        },
                      + {
                          + name      = "USERID_SALT"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:SharesAPI/Prod/USER_CONTEXT_SALT:userid_salt::"
                        },
                    ]
                    # (11 unchanged attributes hidden)
                },
                {
                    command                = [
                        "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                    cpu                    = 0
                    environment            = []
                    essential              = true
                    image                  = "amazon/aws-otel-collector"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/SharesAPI-Prod/ecs/aws-otel-collector"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "aws-otel-collector"
                    portMappings           = [
                        {
                            containerPort = 4138
                            hostPort      = 4138
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4137
                            hostPort      = 4137
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    repositoryCredentials  = {
                        credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                    systemControls         = []
                    volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "SharesAPI-Prod" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
        tags                     = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "SharesAPI"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharesAPI-Prod:9" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"f8b95002-4260-4436-9784-9bb30d70bbdb","JobName":"shares-api_infrastructure_plan_prod","PRNumber":522,"Program":"tfcmt","SHA1":"40199b1d6afb36abf7a62579b80bc9355cd3abcc","Target":"shares-api-cdk","Vars":{}} -->